{
  "backend/main.mo": "Motoko actor that composes blob storage functionality via the MixinStorage mixin, serving as the backend entry point.",
  "feature_evidence.json": "Evidence report mapping three implemented features (Roblox game card, Roblox play page, updated game count in Header/Footer) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing their roles in the neon arcade-themed gaming hub.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH color tokens for light and dark themes, including sidebar, chart, and UI component variables.",
  "frontend/index.html": "HTML entry point for the Gaming Hub app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React app component that configures TanStack Router with a root layout (Header + Footer) and routes for the home page and game play page (/play/$gameId).",
  "frontend/src/components/Footer.tsx": "Footer component displaying the Arcade Hub branding, a list of all 11 games including Roblox, copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/GameCard.tsx": "Reusable game card component rendering a thumbnail, genre badge, title, description, and Play Now button with four neon accent color variants and hover animations.",
  "frontend/src/components/GameLibrary.tsx": "Game library section that renders a responsive grid of 11 GameCard components, including the newly added Roblox card with Sandbox genre and yellow accent.",
  "frontend/src/components/Header.tsx": "Sticky header with the Arcade Hub logo, Home and Games navigation links, and a badge displaying '11 GAMES' in neon green.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context backed by DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file reserved for future backend query hooks; currently exports nothing.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind base/components/utilities, defines CSS custom properties for a dark neon theme, and adds utility classes for neon text, borders, glows, and scanline effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/GamePlayPage.tsx": "Page component that reads a game ID from the route params, looks up game metadata, and renders a toolbar with navigation/external-link controls plus an iframe embedding the game's URL.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with logo, tagline, CTA buttons, and stats, followed by a GameLibrary component listing available games.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with neon color palette (oklch), arcade/orbitron/rajdhani font families, neon box-shadow utilities, and custom keyframe animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state version 7 for an arcade-style gaming hub website featuring 11 games embedded via iframes, including architectural notes, existing features, known issues, and image requirements."
}