{
  "backend/main.mo": "Entry point for the Motoko backend actor that composes blob storage functionality via the MixinStorage mixin.",
  "feature_evidence.json": "Feature evidence report mapping two fullscreen-related features (toggle button and header/footer hiding) to their implementing files and associated test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, covering styles, config, pages, components, hooks, and game implementations.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based design tokens for light and dark themes including background, foreground, primary, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the React app with a root div and a module script entry point targeting src/main.tsx.",
  "frontend/src/App.tsx": "Root app component that sets up TanStack Router with home and game-play routes, provides a FullscreenContext, and conditionally hides Header/Footer when fullscreen is active.",
  "frontend/src/components/Footer.tsx": "Footer component displaying the Arcade Hub logo, a list of all 11 game titles, copyright year, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/GameCard.tsx": "Reusable game card component rendering a thumbnail, genre badge, title, description, and Play Now button with four neon accent color variants and hover animations.",
  "frontend/src/components/GameLibrary.tsx": "Game library section that defines metadata for all 11 games and renders them in a responsive grid of GameCard components with neon arcade styling.",
  "frontend/src/components/games/ArenaBlitzGame.tsx": "Canvas-based top-down arena shooter where the player moves with WASD and aims with the mouse to fight waves of chaser, shooter, and bouncer enemies across escalating rounds.",
  "frontend/src/components/games/AsteroidsGame.tsx": "Canvas clone of Asteroids with wrapping movement, multi-size asteroid splitting, bullet firing, lives, score, and wave progression rendered in a neon retro style.",
  "frontend/src/components/games/BreakoutGame.tsx": "Canvas Breakout game featuring a multi-row colored brick grid with varying HP, paddle control via keyboard, ball physics, lives, and score display.",
  "frontend/src/components/games/CyberStrikeGame.tsx": "Canvas vertical shoot-em-up where the player's ship moves horizontally and fires upward at waves of basic, fast, and tank enemies with particle explosion effects.",
  "frontend/src/components/games/FlappyBirdGame.tsx": "Canvas Flappy Bird clone with gravity, tap/click flap input, scrolling pipe obstacles, score tracking with high score, and a neon cyberpunk visual style.",
  "frontend/src/components/games/GridWarsGame.tsx": "A turn-based tactical grid game where the player commands soldiers, tanks, and snipers on an 8x8 board against an AI enemy, with move/attack phases and win/loss detection.",
  "frontend/src/components/games/MemoryGame.tsx": "A card-matching memory game with 8 symbol pairs, tracking moves, matched pairs, and elapsed time, with neon-styled flip animations and a restart option.",
  "frontend/src/components/games/NeonKickGame.tsx": "A canvas-based 2D neon soccer game where the player controls a character against an AI opponent, with goal detection, score tracking, and a win condition at 5 goals.",
  "frontend/src/components/games/NeonRacersGame.tsx": "A canvas-based top-down lane-racing game where the player dodges AI cars across 5 lanes over a set distance, tracking speed, score, and overtakes.",
  "frontend/src/components/games/PixelVoyageGame.tsx": "A Flappy Bird-style canvas game where the player taps/presses to fly a bird through scrolling neon pipes, with particle effects, score tracking, and a high score.",
  "frontend/src/components/games/PlatformerGame.tsx": "A side-scrolling 2D platformer game rendered on an HTML canvas with a player that can jump, collect coins, avoid enemies, and reach a goal flag across a multi-platform level with camera scrolling.",
  "frontend/src/components/games/PongGame.tsx": "A two-player Pong game rendered on an HTML canvas where Player 1 uses W/S keys and Player 2 uses arrow keys, with ball speed increasing on paddle hits and a first-to-7 win condition.",
  "frontend/src/components/games/PrismJumpGame.tsx": "An endless tunnel-runner game where a gravity-affected ball must navigate through procedurally generated colored tunnel segments by jumping, collecting gems for bonus points.",
  "frontend/src/components/games/RuneQuestGame.tsx": "A top-down arena shooter where the player casts colored rune projectiles using the mouse to defeat waves of enemies (goblins, orcs, mages) across escalating levels while managing health and mana.",
  "frontend/src/components/games/ShadowRunGame.tsx": "An endless side-scrolling runner game where the player jumps or ducks to avoid low and high obstacles on a neon-grid background, with increasing speed over time.",
  "frontend/src/components/games/SnakeGame.tsx": "Implements a classic Snake game on an HTML5 canvas with neon visuals, tracking score and game-over state via React hooks and a ref-based game loop.",
  "frontend/src/components/games/SpaceInvadersGame.tsx": "Implements a Space Invaders clone on an HTML5 canvas with animated aliens, player bullets, lives, waves, and a neon retro visual style.",
  "frontend/src/components/games/StellarAssaultGame.tsx": "A rhythm-based space shooter where the player dodges asteroids, lasers, and mines that spawn on beats, featuring particles, combos, and a scrolling star background.",
  "frontend/src/components/games/TetrisGame.tsx": "Implements a Tetris game on an HTML5 canvas with standard tetrominoes, line clearing, level progression, score tracking, and a next-piece preview canvas.",
  "frontend/src/components/games/VoxelRealmsGame.tsx": "A tower-defense game rendered on an HTML5 canvas where players place towers and walls on a grid to stop waves of enemies following a fixed path, with gold, lives, and wave progression.",
  "frontend/src/components/Header.tsx": "Sticky navigation header for Arcade Hub with a logo, Home link, a smooth-scroll Games button, and a badge showing the total game count.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file with no active code, reserved for future backend query integration.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining CSS custom properties for a dark neon-themed design system with oklch colors, neon glow utilities, and scanline effects.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/GamePlayPage.tsx": "Page component that lazily loads and renders one of 11 game components based on the route's gameId param, with a toolbar providing back navigation and a fullscreen toggle button synced to the Fullscreen API.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with logo, neon-styled title, CTA buttons, and a stats display, followed by a GameLibrary component for browsing available games.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with oklch-based neon color tokens, arcade/orbitron/rajdhani font families, neon box-shadow utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking implemented features (fullscreen toggle, hide header/footer in fullscreen) and a pending request to display games in fullscreen mode for the Arcade Hub multi-game project."
}