{
  "kind": "build_request",
  "title": "Add Roblox game card and iframe embed",
  "projectName": "Arcade Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Add a Roblox game card to the GameLibrary section. The card must follow the existing GameCard component pattern with a thumbnail image, genre badge (e.g., 'Sandbox'), title 'Roblox', a short description, and a 'Play Now' button styled with the neon arcade theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you add Roblox"
        ]
      },
      "acceptanceCriteria": [
        "A Roblox game card appears in the GameLibrary grid alongside the existing 10 games.",
        "The card displays a thumbnail image, a genre badge, the title 'Roblox', a short description, and a 'Play Now' button.",
        "The card styling matches the existing neon arcade theme and GameCard component pattern."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add an iframe embed play page for Roblox at route /play/roblox using the URL https://www.roblox.com/games. The page must embed the game in a full-width iframe consistent with the existing GamePlayPage pattern.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you add Roblox"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Play Now' on the Roblox card navigates to /play/roblox.",
        "The play page embeds https://www.roblox.com/games in a full-width iframe.",
        "The page includes the standard toolbar (navigation, fullscreen, external link) consistent with other GamePlayPage instances."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the Header and Footer components to reflect the expanded game count (now 11 games total). The game count badge in the Header should display '11 GAMES' and the Footer game list should include Roblox.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Can you add Roblox"
        ]
      },
      "acceptanceCriteria": [
        "The Header badge displays '11 GAMES'.",
        "The Footer game list includes Roblox alongside all existing 10 games."
      ]
    }
  ],
  "constraints": [
    "Follow the existing GameCard component pattern exactly — do not alter the component's interface.",
    "The new route must use the same /play/$gameId pattern as existing game play pages.",
    "Do not modify any files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Modifying any backend logic.",
    "Changing the visual theme or layout of existing game cards.",
    "Adding any authentication or user account features."
  ],
  "imageRequirements": {
    "required": [
      "Neon arcade-styled thumbnail illustration for Roblox — dark background with vivid neon accents, pixel/retro game art aesthetic (roblox-thumb.dim_400x300.png)"
    ],
    "edits": []
  }
}