{
  "kind": "build_request",
  "title": "Add fullscreen mode to game play page",
  "projectName": "Arcade Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a fullscreen toggle button to the GamePlayPage toolbar that expands the game container to fill the entire browser viewport using the Fullscreen API (document.documentElement.requestFullscreen). The button should show an 'Enter Fullscreen' icon when not in fullscreen and an 'Exit Fullscreen' icon when active. Listen to the 'fullscreenchange' event to keep button state in sync.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you make it full screan"
        ]
      },
      "acceptanceCriteria": [
        "A fullscreen toggle button is visible in the GamePlayPage toolbar.",
        "Clicking the button expands the page to fill the entire screen using the Fullscreen API.",
        "The button icon/label updates to reflect the current fullscreen state.",
        "Pressing Escape or clicking the button again exits fullscreen and restores the normal view.",
        "The game canvas resizes correctly to fill the fullscreen area."
      ]
    },
    {
      "id": "REQ-2",
      "text": "When in fullscreen mode, hide the Header and Footer components so only the game content is visible. The game canvas and HUD should stretch to use the full available screen space.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you make it full screan"
        ]
      },
      "acceptanceCriteria": [
        "Header and Footer are not visible when the game is in fullscreen mode.",
        "The game canvas occupies the full screen with no dead space.",
        "Exiting fullscreen restores the Header and Footer to their normal positions."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ or frontend/src/components/ui.",
    "Do not alter individual game component files — fullscreen logic must be contained in GamePlayPage."
  ],
  "nonGoals": [
    "Adding fullscreen support on the HomePage or GameLibrary.",
    "Changing game logic or canvas rendering internals.",
    "Backend changes of any kind."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}