{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Roblox game card and iframe embed",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Add a Roblox game card to the GameLibrary section following the existing GameCard component pattern with thumbnail, genre badge, title, description, and Play Now button styled with neon arcade theme",
      "acceptanceCriteria": [
        "A Roblox game card appears in the GameLibrary grid alongside the existing 10 games.",
        "The card displays a thumbnail image, a genre badge, the title 'Roblox', a short description, and a 'Play Now' button.",
        "The card styling matches the existing neon arcade theme and GameCard component pattern."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GameLibrary.tsx",
          "operation": "modify",
          "description": "Add a new GameCard component instance for Roblox with thumbnail path 'frontend/public/assets/generated/roblox-thumb.dim_400x300.png', genre 'Sandbox', title 'Roblox', description text, accent color variant, and /play/roblox route. Insert it into the existing grid alongside the 10 current games."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add an iframe embed play page for Roblox at route /play/roblox using https://www.roblox.com/games, consistent with existing GamePlayPage pattern",
      "acceptanceCriteria": [
        "Clicking 'Play Now' on the Roblox card navigates to /play/roblox.",
        "The play page embeds https://www.roblox.com/games in a full-width iframe.",
        "The page includes the standard toolbar (navigation, fullscreen, external link) consistent with other GamePlayPage instances."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamePlayPage.tsx",
          "operation": "modify",
          "description": "Add a game entry for Roblox (id: 'roblox', name: 'Roblox', url: 'https://www.roblox.com/games') to the games array so the existing GamePlayPage component can render it via the /play/roblox route."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Update the Header and Footer components to reflect the expanded game count (now 11 games total)",
      "acceptanceCriteria": [
        "The Header badge displays '11 GAMES'.",
        "The Footer game list includes Roblox alongside all existing 10 games."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update the game count badge text from '10 GAMES' to '11 GAMES' to reflect the addition of Roblox."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add 'Roblox' to the games list array in the Footer component so it displays alongside the existing 10 games in the footer section."
        }
      ]
    }
  ]
}